TestPlans/Car/Drivology/xml/DRI3_15122014_4.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ssp="http://SSP.Authentication.Services/" xmlns:mot="http://WebServices.ssp-uk.com/MotorAggregator/" xmlns:pmq="http://ssp.web.services/MotorAggregator/schemas/PMQuoteData.xsd">
  <soapenv:Header>
    <ssp:Security xmlns="http://WebServices.ssp-uk.com/MotorAggregator/">
      <ssp:SystemUsername>1045678055</ssp:SystemUsername>
      <ssp:SystemPassword>AE9ACEEC-D1CA-4BF9-8318-66C61EF5B74F</ssp:SystemPassword>
      <ssp:SystemID>2</ssp:SystemID>
    </ssp:Security>
  </soapenv:Header>
  <soapenv:Body>
    <mot:GetQuote>
      <mot:PMQuoteData>
        <pmq:PMQuoteDataID>20646</pmq:PMQuoteDataID>
        <pmq:Control>
          <pmq:ProcessQuoteDetail>true</pmq:ProcessQuoteDetail>
          <pmq:ProcessDocuments>true</pmq:ProcessDocuments>
          <pmq:ProcessEndorsements>false</pmq:ProcessEndorsements>
          <pmq:ProcessUseDetail>true</pmq:ProcessUseDetail>
          <pmq:ProcessUWNotes>true</pmq:ProcessUWNotes>
          <pmq:ProcessWarnings>true</pmq:ProcessWarnings>
          <pmq:ProcessPremiumBreakdown>false</pmq:ProcessPremiumBreakdown>
          <pmq:ProcessExcesses>true</pmq:ProcessExcesses>
          <pmq:LOB>
            <pmq:Description>PMC</pmq:Description>
            <pmq:Abi>1</pmq:Abi>
          </pmq:LOB>
          <pmq:QuotePanel>
            <pmq:Description>Broker Panel</pmq:Description>
            <pmq:Abi>2</pmq:Abi>
          </pmq:QuotePanel>
          <pmq:Polaris>true</pmq:Polaris>
          <pmq:SSP>true</pmq:SSP>
          <pmq:SingleQuoteRequest>
            <pmq:QuoteMultipleBroker>true</pmq:QuoteMultipleBroker>
            <pmq:BrokerSCIDs>A09961</pmq:BrokerSCIDs>
          </pmq:SingleQuoteRequest>
          <pmq:CreditControlConsent>false</pmq:CreditControlConsent>
          <pmq:EnrichmentReference>12345ABD</pmq:EnrichmentReference>
          <pmq:TransactionType>NewBusiness</pmq:TransactionType>
        </pmq:Control>
        <pmq:Policy>
          <pmq:CoverDate>2014-12-17</pmq:CoverDate>
          <pmq:CoverType>
            <pmq:Description>Comprehensive</pmq:Description>
            <pmq:Abi>01</pmq:Abi>
          </pmq:CoverType>
          <pmq:DrivingRestriction>
            <pmq:Description>Insured and Named Drivers</pmq:Description>
            <pmq:Abi>7</pmq:Abi>
          </pmq:DrivingRestriction>
          <pmq:VehicleUsage>
            <pmq:Description>Business Use Policy Holder In Person</pmq:Description>
            <pmq:Abi>3</pmq:Abi>
          </pmq:VehicleUsage>
          <pmq:VoluntaryExcess>700</pmq:VoluntaryExcess>
        </pmq:Policy>
        <pmq:Proposer>
          <pmq:Address>
            <pmq:Address1>2 Duke of Edinburgh Way</pmq:Address1>
            <pmq:Town>Malvern</pmq:Town>
            <pmq:County />
            <pmq:PostCode>WR14 1AZ</pmq:PostCode>
          </pmq:Address>
          <pmq:HomeTelephone>01733320300</pmq:HomeTelephone>
          <pmq:Email>transformerPC04@emailreaction.org</pmq:Email>
          <pmq:PaymentFrequency>
            <pmq:Description>Annually</pmq:Description>
            <pmq:Abi>A</pmq:Abi>
          </pmq:PaymentFrequency>
          <pmq:PreviousInsurance>
            <pmq:PreviousInsuranceEndDate>2014-12-17</pmq:PreviousInsuranceEndDate>
            <pmq:PreviousInsurer>
              <pmq:Description>UNKNOWN</pmq:Description>
              <pmq:Abi>997</pmq:Abi>
            </pmq:PreviousInsurer>
          </pmq:PreviousInsurance>
          <pmq:ProposerType>
            <pmq:Description>Private</pmq:Description>
            <pmq:Abi>P</pmq:Abi>
          </pmq:ProposerType>
          <pmq:NumberOfCarsInFamily>5</pmq:NumberOfCarsInFamily>
        </pmq:Proposer>
        <pmq:NCD>
          <pmq:Protected>false</pmq:Protected>
          <pmq:NCDType>
            <pmq:Description>Private Motor</pmq:Description>
            <pmq:Abi>11</pmq:Abi>
          </pmq:NCDType>
          <pmq:Years>0</pmq:Years>
        </pmq:NCD>
        <pmq:Drivers>
          <pmq:Driver>
            <pmq:AccessOtherCars>1</pmq:AccessOtherCars>
            <pmq:Claims>
              <pmq:Claim>
                <pmq:CostOwn>0</pmq:CostOwn>
                <pmq:DateMade>2012-04-01</pmq:DateMade>
                <pmq:FaultType>
                  <pmq:Description>Fault</pmq:Description>
                  <pmq:Abi>A1|Fault</pmq:Abi>
                </pmq:FaultType>
                <pmq:NCDLost>false</pmq:NCDLost>
                <pmq:ThisPolicy>true</pmq:ThisPolicy>
                <pmq:ClaimType>
                  <pmq:Description>Accident</pmq:Description>
                  <pmq:Abi>A</pmq:Abi>
                </pmq:ClaimType>
              </pmq:Claim>
            </pmq:Claims>
            <pmq:Commuting>true</pmq:Commuting>
            <pmq:CriminalConvictions>false</pmq:CriminalConvictions>
            <pmq:Disabled>false</pmq:Disabled>
            <pmq:DOB>1978-04-04</pmq:DOB>
            <pmq:HomeOwner>true</pmq:HomeOwner>
            <pmq:Children>0</pmq:Children>
            <pmq:Licence>
              <pmq:LicenceDate>2011-02-01</pmq:LicenceDate>
              <pmq:LicenceType>
                <pmq:Description>Foreign</pmq:Description>
                <pmq:Abi>I</pmq:Abi>
              </pmq:LicenceType>
            </pmq:Licence>
            <pmq:MaritalStatus>
              <pmq:Description>Single</pmq:Description>
              <pmq:Abi>S</pmq:Abi>
            </pmq:MaritalStatus>
            <pmq:Title>
              <pmq:Description>Miss</pmq:Description>
              <pmq:Abi>002</pmq:Abi>
            </pmq:Title>
            <pmq:FirstName>Debbie</pmq:FirstName>
            <pmq:Surname>Four</pmq:Surname>
            <pmq:Occupations>
              <pmq:Occupation>
                <pmq:Business>
                  <pmq:Description>Not In Employment</pmq:Description>
                  <pmq:Abi>186</pmq:Abi>
                </pmq:Business>
                <pmq:EmploymentStatus>
                  <pmq:Description>In Full Or Part Time Education</pmq:Description>
                  <pmq:Abi>F</pmq:Abi>
                </pmq:EmploymentStatus>
                <pmq:OccupationType>
                  <pmq:Description>Student Nurse - Living At Home</pmq:Description>
                  <pmq:Abi>S52</pmq:Abi>
                </pmq:OccupationType>
              </pmq:Occupation>
            </pmq:Occupations>
            <pmq:Refused>false</pmq:Refused>
            <pmq:RelationshipToProposer>
              <pmq:Description>Proposer</pmq:Description>
              <pmq:Abi>P</pmq:Abi>
            </pmq:RelationshipToProposer>
            <pmq:Residency>
              <pmq:DateToUK>1978-04-04</pmq:DateToUK>
              <pmq:Permanent>true</pmq:Permanent>
              <pmq:Years>36</pmq:Years>
            </pmq:Residency>
            <pmq:Sex>
              <pmq:Description>Female</pmq:Description>
              <pmq:Abi>F</pmq:Abi>
            </pmq:Sex>
            <pmq:SpecialTerms>false</pmq:SpecialTerms>
            <pmq:UsageFrequency>
              <pmq:Description>Main User</pmq:Description>
              <pmq:Abi>M</pmq:Abi>
            </pmq:UsageFrequency>
          </pmq:Driver>
          <pmq:Driver>
            <pmq:AccessOtherCars>1</pmq:AccessOtherCars>
            <pmq:Claims>
              <pmq:Claim>
                <pmq:CostOwn>0</pmq:CostOwn>
                <pmq:DateMade>2011-11-01</pmq:DateMade>
                <pmq:FaultType>
                  <pmq:Description>Fire</pmq:Description>
                  <pmq:Abi>F</pmq:Abi>
                </pmq:FaultType>
                <pmq:NCDLost>false</pmq:NCDLost>
                <pmq:ThisPolicy>true</pmq:ThisPolicy>
                <pmq:ClaimType>
                  <pmq:Description>Fire</pmq:Description>
                  <pmq:Abi>F</pmq:Abi>
                </pmq:ClaimType>
              </pmq:Claim>
            </pmq:Claims>
            <pmq:Commuting>true</pmq:Commuting>
            <pmq:CriminalConvictions>false</pmq:CriminalConvictions>
            <pmq:Disabled>false</pmq:Disabled>
            <pmq:DOB>1979-09-07</pmq:DOB>
            <pmq:HomeOwner>false</pmq:HomeOwner>
            <pmq:Licence>
              <pmq:LicenceDate>2006-12-15</pmq:LicenceDate>
              <pmq:LicenceType>
                <pmq:Description>Provisional (U.K.)</pmq:Description>
                <pmq:Abi>P</pmq:Abi>
              </pmq:LicenceType>
            </pmq:Licence>
            <pmq:MaritalStatus>
              <pmq:Description>Single</pmq:Description>
              <pmq:Abi>S</pmq:Abi>
            </pmq:MaritalStatus>
            <pmq:Title>
              <pmq:Description>Ms</pmq:Description>
              <pmq:Abi>005</pmq:Abi>
            </pmq:Title>
            <pmq:FirstName>Denise</pmq:FirstName>
            <pmq:Surname>Four</pmq:Surname>
            <pmq:Occupations>
              <pmq:Occupation>
                <pmq:Business>
                  <pmq:Description>Not In Employment</pmq:Description>
                  <pmq:Abi>186</pmq:Abi>
                </pmq:Business>
                <pmq:EmploymentStatus>
                  <pmq:Description>Household Duties</pmq:Description>
                  <pmq:Abi>H</pmq:Abi>
                </pmq:EmploymentStatus>
                <pmq:OccupationType>
                  <pmq:Description>Housewife</pmq:Description>
                  <pmq:Abi>H09</pmq:Abi>
                </pmq:OccupationType>
              </pmq:Occupation>
            </pmq:Occupations>
            <pmq:Refused>false</pmq:Refused>
            <pmq:RelationshipToProposer>
              <pmq:Description>Daughter or Son</pmq:Description>
              <pmq:Abi>O</pmq:Abi>
            </pmq:RelationshipToProposer>
            <pmq:Residency>
              <pmq:DateToUK>1979-09-07</pmq:DateToUK>
              <pmq:Permanent>true</pmq:Permanent>
              <pmq:Years>35</pmq:Years>
            </pmq:Residency>
            <pmq:Sex>
              <pmq:Description>Female</pmq:Description>
              <pmq:Abi>F</pmq:Abi>
            </pmq:Sex>
            <pmq:SpecialTerms>false</pmq:SpecialTerms>
            <pmq:UsageFrequency>
              <pmq:Description>Infrequent (Casual)</pmq:Description>
              <pmq:Abi>C</pmq:Abi>
            </pmq:UsageFrequency>
          </pmq:Driver>
        </pmq:Drivers>
        <pmq:Vehicles>
          <pmq:Vehicle>
            <pmq:BodyType>
              <pmq:Description>Saloon/Coupe</pmq:Description>
              <pmq:Abi>01</pmq:Abi>
            </pmq:BodyType>
            <pmq:BusinessMiles>5000</pmq:BusinessMiles>
            <pmq:DateManufactured>2011-12-17</pmq:DateManufactured>
            <pmq:DatePurchased>2013-09-01</pmq:DatePurchased>
            <pmq:DriveSide>
              <pmq:Description>Right Hand Drive</pmq:Description>
              <pmq:Abi>R</pmq:Abi>
            </pmq:DriveSide>
            <pmq:EngineSize>1368</pmq:EngineSize>
            <pmq:Fuel>
              <pmq:Description>Petrol</pmq:Description>
              <pmq:Abi>002</pmq:Abi>
            </pmq:Fuel>
            <pmq:Imported>false</pmq:Imported>
            <pmq:KeptAtProposerAddress>true</pmq:KeptAtProposerAddress>
            <pmq:KeptLocation>
              <pmq:Description>Kept on Public Road</pmq:Description>
              <pmq:Abi>3</pmq:Abi>
            </pmq:KeptLocation>
            <pmq:KeptAddress>
              <pmq:Address1>2 Duke of Edinburgh Way</pmq:Address1>
              <pmq:Town>Malvern</pmq:Town>
              <pmq:County />
              <pmq:PostCode>WR14 1AZ</pmq:PostCode>
              <pmq:KeptHere>Yes</pmq:KeptHere>
            </pmq:KeptAddress>
            <pmq:Make>Fiat</pmq:Make>
            <pmq:Model>Punto</pmq:Model>
            <pmq:Modifications>
              <pmq:Modification>
                <pmq:ModificationType>
                  <pmq:Description>Rear Valance</pmq:Description>
                  <pmq:Abi>29</pmq:Abi>
                </pmq:ModificationType>
                <pmq:ModificationType>
                  <pmq:Description>Front Spoiler/Airdam</pmq:Description>
                  <pmq:Abi>17</pmq:Abi>
                </pmq:ModificationType>
              </pmq:Modification>
            </pmq:Modifications>
            <pmq:PleasureMiles>5000</pmq:PleasureMiles>
            <pmq:NumberDoors>5</pmq:NumberDoors>
            <pmq:NumberSeats>4</pmq:NumberSeats>
            <pmq:VehicleOwner>
              <pmq:Description>Other</pmq:Description>
              <pmq:Abi>9</pmq:Abi>
            </pmq:VehicleOwner>
            <pmq:VehicleKeeper>
              <pmq:Description>Other</pmq:Description>
              <pmq:Abi>9</pmq:Abi>
            </pmq:VehicleKeeper>
            <pmq:Registration>WM11ENP</pmq:Registration>
            <pmq:SecurityDevices>
              <pmq:SecurityDevice>
                <pmq:DeviceFitter>
                  <pmq:Description>Unknown</pmq:Description>
                  <pmq:Abi>6</pmq:Abi>
                </pmq:DeviceFitter>
                <pmq:DeviceType>
                  <pmq:Description>Unknown Immobiliser</pmq:Description>
                  <pmq:Abi>93</pmq:Abi>
                </pmq:DeviceType>
              </pmq:SecurityDevice>
            </pmq:SecurityDevices>
            <pmq:TransmissionType>
              <pmq:Description>Manual</pmq:Description>
              <pmq:Abi>002</pmq:Abi>
            </pmq:TransmissionType>
            <pmq:Value>3000</pmq:Value>
            <pmq:VehicleDetails>
              <pmq:Description>2011 Fiat Punto Evo Dynamic (77), 1368CC Petrol, 5DR, Manual</pmq:Description>
              <pmq:Abi>16553803</pmq:Abi>
            </pmq:VehicleDetails>
          </pmq:Vehicle>
        </pmq:Vehicles>
      </mot:PMQuoteData>
      <mot:sourceOfBusiness>CompareTheMarket</mot:sourceOfBusiness>
    </mot:GetQuote>
  </soapenv:Body>
</soapenv:Envelope>